# Insert Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PlanCircuitSet..::..Insert Method
PlanCircuitSet Class See Also
---
Insert the specified item into the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Insert(
	PlanCircuit item
)
```

Visual Basic
---
```text
Public Overridable Function Insert ( _
	item As PlanCircuit _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Insert(
	PlanCircuit^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..PlanCircuitThe item to be inserted into the set.
# ### Return Value
Returns whether the item was inserted into the set.
# See Also
PlanCircuitSet Class
Autodesk.Revit.DB Namespace